In [1]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt
from sklearn import linear_model

In [2]:
df = pd.read_csv("D:\Tahir\IBM all Lab\Machine learning\carprice.csv")
df

                Car Model  Mileage  Sell Price($)  Age(yrs)  Unnamed: 4
0                  BMW X5    69000          18000         6         NaN
1                  BMW X5    35000          34000         3         NaN
2                  BMW X5    57000          26100         5         NaN
3                  BMW X5    22500          40000         2         NaN
4                  BMW X5    46000          31500         4         NaN
5                 Audi A5    59000          29400         5         NaN
6                 Audi A5    52000          32000         5         NaN
7                 Audi A5    72000          19300         6         NaN
8                 Audi A5    91000          12000         8         NaN
9   Mercedez Benz C class    67000          22000         6         NaN
10  Mercedez Benz C class    83000          20000         7         NaN
11  Mercedez Benz C class    79000          21000         7         NaN
12  Mercedez Benz C class    59000          33000         5         NaN

In [3]:
df.columns

Index(['Car Model', 'Mileage', 'Sell Price($)', 'Age(yrs)', 'Unnamed: 4'], dtype='object')

In [4]:
df.drop(['Car Model','Unnamed: 4'],axis=1,inplace=True) 
df

    Mileage  Sell Price($)  Age(yrs)
0     69000          18000         6
1     35000          34000         3
2     57000          26100         5
3     22500          40000         2
4     46000          31500         4
5     59000          29400         5
6     52000          32000         5
7     72000          19300         6
8     91000          12000         8
9     67000          22000         6
10    83000          20000         7
11    79000          21000         7
12    59000          33000         5

In [5]:
from sklearn.model_selection import train_test_split

In [6]:
x = df[['Mileage','Age(yrs)']]
y = df['Sell Price($)']

x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2,random_state =10) # tesst_size = 0.2 means 20% of the data will be used for test

x_train

    Mileage  Age(yrs)
6     52000         5
8     91000         8
2     57000         5
12    59000         5
5     59000         5
10    83000         7
1     35000         3
0     69000         6
4     46000         4
9     67000         6

In [7]:
from sklearn.linear_model import LinearRegression 
model = LinearRegression()
model.fit(x_train,y_train)

LinearRegression()

In [8]:
model.predict(x_test)     # the predicted value

array([41842.49106079, 22531.68057211, 18423.93325387])

In [9]:
y_test    # actual values

3     40000
7     19300
11    21000
Name: Sell Price($), dtype: int64

In [10]:
# both values are near to equal but not the same

In [11]:
model.score(x_test,y_test)   # accuracy

0.9224816911971747